#+LATEX_CLASS: dnd
#+STARTUP: content showstars indent
#+OPTIONS: tags:nil
#+TITLE: Bo Grimspine's Character Sheet
#+FILETAGS: bo grimespine character sheet

* Constants
  #+NAME: define-constants-with-src-block
  #+BEGIN_SRC elisp :var table=stats :colnames yes :results output drawer :cache yes :lang elisp
    (dnd-output-ability-constants table)
  #+END_SRC

  #+RESULTS[1d31cbe5ecc6d9782632d38028643469293a1ef4]: define-constants-with-src-block
  :results:
  #+CONSTANTS: STR=15
  #+CONSTANTS: DEX=10
  #+CONSTANTS: CON=15
  #+CONSTANTS: INT=8
  #+CONSTANTS: WIS=16
  #+CONSTANTS: CHA=12
  #+CONSTANTS: PROF=2
  #+CONSTANTS: SCA=
  #+CONSTANTS: SAM=
  :end:
  
* Traits
| Level | Race  | Subrace | Class  | Subclass     | Alignment      | Size   |
|-------+-------+---------+--------+--------------+----------------+--------|
|     4 | Dwarf | Hill    | Cleric | Forge Domain | Lawful Neutral | Medium |

* Stats  
| Speed | Hit Points | AC | Saves | Inspo | Hit dice | Exhaustion |
|-------+------------+----+-------+-------+----------+------------|
| 30 ft | 27/35 (d8) | 20 |       |       |        4 |            |

* Abilities and Skills
#+name: stats
| Ability | Score | Mod | PB | Roll           | Skill                      | Expert |
|---------+-------+-----+----+----------------+----------------------------+--------|
| STR     |    15 |   2 |    | 1d20 + 2       | Saving Throw *(A) Grapple* |        |
|         |       |     |    | 1d20 + 2       | Athletics                  |        |
|---------+-------+-----+----+----------------+----------------------------+--------|
| DEX     |    10 |   0 |    | 1d20 + 0       | Saving Throw *(A) Grapple* |        |
|         |       |     | X  | 1d20 + 2       | Acrobatics                 |        |
|         |       |     |    | 1d20 + 0       | Sleight of Hand            |        |
|         |       |     |    | 1d20 + 0       | Stealth *(D) Heavy Armor*  |        |
|---------+-------+-----+----+----------------+----------------------------+--------|
| CON     |    15 |   2 |    | 1d20 + 2       | Saving Throw               |        |
|---------+-------+-----+----+----------------+----------------------------+--------|
| INT     |     8 |  -1 |    | 1d20 + -1      | Saving Throw               |        |
|         |       |     |    | 1d20 + -1      | Arcana                     |        |
|         |       |     | X  | 1d20 + 1       | History                    | Stone  |
|         |       |     |    | 1d20 + -1      | Investigation              |        |
|         |       |     |    | 1d20 + -1      | Nature                     |        |
|         |       |     |    | 1d20 + -1      | Religion                   |        |
|---------+-------+-----+----+----------------+----------------------------+--------|
| WIS     |    16 |   3 | X  | 1d20 + 5       | Saving Throw               |        |
|         |       |     |    | 1d20 + 3       | Animal Handling            |        |
|         |       |     |    | 1d20 + 3       | Insight                    |        |
|         |       |     | X  | 1d20 + 5       | Medicine                   |        |
|         |       |     |    | 1d20 + 3       | Perception                 |        |
|         |       |     |    | 1d20 + 3       | Survival                   |        |
|---------+-------+-----+----+----------------+----------------------------+--------|
| CHA     |    12 |   1 | X  | 1d20 + 3       | Saving Throw               |        |
|         |       |     |    | 1d20 + 1       | Deception                  |        |
|         |       |     |    | 1d20 + 1       | Intimidation               |        |
|         |       |     |    | 1d20 + 1       | Performance                |        |
|         |       |     |    | 1d20 + 1       | Persuasion                 |        |
|---------+-------+-----+----+----------------+----------------------------+--------|
| PROF    |     2 |     |    |                |                            |        |
| SCA     |       |     |    | 8 + PROF + WIS | SPELL CASTING ABILITY      |        |
| SAM     |       |     |    | PROF + WIS     | SPELL ATT MOD              |        |
#+TBLFM: @2$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
#+TBLFM: @4$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
#+TBLFM: @8$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
#+TBLFM: @9$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
#+TBLFM: @15$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
#+TBLFM: @21$3='(calc-dnd-mod (string-to-number (org-table-get-constant $1)))
#+TBLFM: @2$5..@3$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @2$1))))))
#+TBLFM: @4$5..@7$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @4$1))))))
#+TBLFM: @8$5..@8$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @8$1))))))
#+TBLFM: @9$5..@14$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @9$1))))))
#+TBLFM: @15$5..@20$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @15$1))))))
#+TBLFM: @21$5..@25$5='(concat "1d20 + " (number-to-string (+ (if (string= $4 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant @21$1))))))

* Resistances

- Poison ::

** Conditions

* Attacks
#+NAME: attacks
| Weapon        | Ability | Prof | Type       | SubType | Die | Mod To Hit | Roll    | Roll |
|---------------+---------+------+------------+---------+-----+------------+---------+------|
| War Hammer +1 | STR     | X    | Bludeoning |         | 1d6 |          4 | 1d6 + 2 |      |
#+TBLFM: $7='(+ (if (string= $3 "X") $PROF 0) (calc-dnd-mod (string-to-number (org-table-get-constant $2))))
#+TBLFM: $8='(concat $6 " + " (number-to-string (calc-dnd-mod (string-to-number (org-table-get-constant $2)))))

* Proficiencies
| Languages | Tools          | Armor   | Weapons      |
|-----------+----------------+---------+--------------|
| Common    | Brewer's Tools | Light   | Simple       |
| Dwarfish  | Smith's Tools  | Medium  | Battleaxe    |
|           |                | Heavy   | Handaxe      |
|           |                | Shields | Light Hammer |
|           |                |         | Warhammer    |

* Equipment
| Name                                 | Quantity | Cost (gp) | Weight (lbs) | Capacity | Total Weight (lbs) | Total Cost (gp) |
|--------------------------------------+----------+-----------+--------------+----------+--------------------+-----------------|
| Potion of Vitality                   |        1 |         0 |            0 |          |                  0 |               0 |
| [[file:equipment.org::Jewel of Three Prayers (Dormant)][Jewel Of Three Prayers]]               |        1 |         0 |            0 |          |                  0 |               0 |
| Warhammer (+1 Blessing of the Forge) |        1 |         0 |            2 |          |                  2 |               0 |
| Amulet (Holy Symbol)                 |        1 |         5 |            1 |          |                  1 |               5 |
| Backpack                             |        1 |         2 |            5 |       30 |                  5 |               2 |
| Bedroll                              |        1 |         1 |            7 |          |                  7 |               1 |
| Blanket                              |        1 |        .5 |            3 |          |                  3 |             0.5 |
| Chain mail                           |        1 |        75 |           55 |          |                 55 |              75 |
| Clothes (Common)                     |        1 |        .5 |            3 |          |                  3 |             0.5 |
| Ink (1 oz)                           |        1 |        10 |            0 |          |                  0 |              10 |
| Mess Kit                             |        1 |        .2 |            1 |          |                  1 |             0.2 |
| Parchment (one sheet)                |        3 |        .3 |            0 |          |                  0 |             0.9 |
| Playing Card Set                     |        1 |        .5 |            0 |          |                  0 |             0.5 |
| Rations (1 Day)                      |        9 |        .5 |            2 |          |                 18 |             4.5 |
| Rope, Hempen (50 feet)               |        1 |         1 |           10 |          |                 10 |               1 |
| Shield                               |        1 |        10 |            6 |          |                  6 |              10 |
| Shortbow                             |        1 |        25 |            2 |          |                  2 |              25 |
| Tinderbox                            |        1 |        .5 |            1 |          |                  1 |             0.5 |
| Torch                                |       10 |        .1 |            1 |          |                 10 |              1. |
| Waterskin                            |        1 |        .2 |            5 |          |                  5 |             0.2 |
|--------------------------------------+----------+-----------+--------------+----------+--------------------+-----------------|
| Carry Capacity                       |      200 |           |              |          |                  0 |               0 |
#+TBLFM: $6=($2 * $4)
#+TBLFM: $7=($2 * $3)
#+TBLFM: @24$6=vsum(@3$6..@36$6)
#+TBLFM: @24$7=vsum(@3$7..@29$7)
#+TBLFM: @24$2=($STR * 10)

** Attunement

- Jewel of Three Prayers ::
|------+---+---+---|
| Used |   |   |   |
|------+---+---+---|

** Money
| Copper | Silver | Electrum | Gold | Platinum | Total (Gold) |
|--------+--------+----------+------+----------+--------------|
|      0 |      0 |        0 |    0 |        0 |            0 |
#+TBLFM: $6=(($1 / 100) + ($2 / 10) + ($3 / 2) + $4 + ($5 * 10))
   

   
